; domain
;; =====================================================================
;; Zadanie 3: Robot z dwoma ramionami przenosi pilki miedzy pokojami.
;; Domena PODANA w tresci zadania.
;; =====================================================================
(define (domain ball-moving-robot)

  (:requirements :strips :typing)

  (:types robot room ball arm)

  (:predicates
    (at ?r - robot ?rm - room)
    (inroom ?b - ball ?rm - room)
    (holding ?a - arm ?b - ball)
    (arm-empty ?a - arm)
  )

  (:action move
    :parameters (?r - robot ?from - room ?to - room)
    :precondition (at ?r ?from)
    :effect (and (not (at ?r ?from)) (at ?r ?to))
  )

  (:action pick-up
    :parameters (?r - robot ?a - arm ?b - ball ?rm - room)
    :precondition (and (at ?r ?rm) (inroom ?b ?rm) (arm-empty ?a))
    :effect (and (holding ?a ?b) (not (arm-empty ?a)) (not (inroom ?b ?rm)))
  )

  (:action put-down
    :parameters (?r - robot ?a - arm ?b - ball ?rm - room)
    :precondition (and (at ?r ?rm) (holding ?a ?b))
    :effect (and (inroom ?b ?rm) (arm-empty ?a) (not (holding ?a ?b)))
  )
)

; problem
;; =====================================================================
;; Zadanie 3: Problem -- 4 pilki, robot z 2 ramionami.
;; Wszystkie pilki startuja w room1, cel: wszystkie w room2.
;;
;; UWAGA: w PDF zadania w pliku problem.pddl byly literowki w nawiasach:
;; - linijka 1: "define (..." zamiast "(define (..."
;; - linijka 29: dodatkowy nawias zamykajacy
;; Tutaj poprawione.
;; =====================================================================
(define (problem move-balls)
  (:domain ball-moving-robot)

  (:objects
    room1 room2              - room
    robot                    - robot
    ball1 ball2 ball3 ball4  - ball
    arm1 arm2                - arm
  )

  (:init
    (at robot room1)
    (inroom ball1 room1)
    (inroom ball2 room1)
    (inroom ball3 room1)
    (inroom ball4 room1)
    (arm-empty arm1)
    (arm-empty arm2)
  )

  (:goal (and
    (inroom ball1 room2)
    (inroom ball2 room2)
    (inroom ball3 room2)
    (inroom ball4 room2)
  ))
)

; plan
1. (pick-up robot arm2 ball2 room1)
   deleted: (arm-empty arm2) (inroom ball2 room1)
   added: (holding arm2 ball2)
   goals met: 0 of 4
2. (pick-up robot arm1 ball4 room1)
   deleted: (arm-empty arm1) (inroom ball4 room1)
   added: (holding arm1 ball4)
   goals met: 0 of 4
3. (move robot room1 room2)
   deleted: (at robot room1)
   added: (at robot room2)
   goals met: 0 of 4
4. (put-down robot arm2 ball2 room2)
   deleted: (holding arm2 ball2)
   added: (inroom ball2 room2) (arm-empty arm2)
   goals met: 1 of 4
5. (put-down robot arm1 ball4 room2)
   deleted: (holding arm1 ball4)
   added: (inroom ball4 room2) (arm-empty arm1)
   goals met: 2 of 4
6. (move robot room2 room1)
   deleted: (at robot room2)
   added: (at robot room1)
   goals met: 2 of 4
7. (pick-up robot arm2 ball1 room1)
   deleted: (arm-empty arm2) (inroom ball1 room1)
   added: (holding arm2 ball1)
   goals met: 2 of 4
8. (pick-up robot arm1 ball3 room1)
   deleted: (arm-empty arm1) (inroom ball3 room1)
   added: (holding arm1 ball3)
   goals met: 2 of 4
9. (move robot room1 room2)
   deleted: (at robot room1)
   added: (at robot room2)
   goals met: 2 of 4
10. (put-down robot arm2 ball1 room2)
   deleted: (holding arm2 ball1)
   added: (inroom ball1 room2) (arm-empty arm2)
   goals met: 3 of 4
11. (put-down robot arm1 ball3 room2)
   deleted: (holding arm1 ball3)
   added: (inroom ball3 room2) (arm-empty arm1)
   goals met: 4 of 4
